RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/bl702_pds.h
/**
  ******************************************************************************
  * @file    bl702_pds.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL702_PDS_H__
#define __BL702_PDS_H__

#include "pds_reg.h"
#include "bl702_ef_ctrl.h"
#include "bl702_aon.h"
#include "bl702_hbn.h"
#include "bl702_common.h"
#include "bflb_sflash.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PDS
 *  @{
 */

/** @defgroup  PDS_Public_Types
 *  @{
 */

/**
 *  @brief PDS LDO level type definition
 */
typedef enum {
    PDS_LDO_LEVEL_0P60V = 0,  /*!< PDS LDO voltage 0.60V */
    PDS_LDO_LEVEL_0P65V = 1,  /*!< PDS LDO voltage 0.65V */
    PDS_LDO_LEVEL_0P70V = 2,  /*!< PDS LDO voltage 0.70V */
    PDS_LDO_LEVEL_0P75V = 3,  /*!< PDS LDO voltage 0.75V */
    PDS_LDO_LEVEL_0P80V = 4,  /*!< PDS LDO voltage 0.80V */
    PDS_LDO_LEVEL_0P85V = 5,  /*!< PDS LDO voltage 0.85V */
    PDS_LDO_LEVEL_0P90V = 6,  /*!< PDS LDO voltage 0.90V */
    PDS_LDO_LEVEL_0P95V = 7,  /*!< PDS LDO voltage 0.95V */
    PDS_LDO_LEVEL_1P00V = 8,  /*!< PDS LDO voltage 1.00V */
    PDS_LDO_LEVEL_1P05V = 9,  /*!< PDS LDO voltage 1.05V */
    PDS_LDO_LEVEL_1P10V = 10, /*!< PDS LDO voltage 1.10V */
    PDS_LDO_LEVEL_1P15V = 11, /*!< PDS LDO voltage 1.15V */
    PDS_LDO_LEVEL_1P20V = 12, /*!< PDS LDO voltage 1.20V */
    PDS_LDO_LEVEL_1P25V = 13, /*!< PDS LDO voltage 1.25V */
    PDS_LDO_LEVEL_1P30V = 14, /*!< PDS LDO voltage 1.30V */
    PDS_LDO_LEVEL_1P35V = 15, /*!< PDS LDO voltage 1.35V */
} PDS_LDO_LEVEL_Type;

/**
 *  @brief PDS RAM configuration type definition
 */
typedef struct
{
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_RET1N  : 1;  /*!< [0] 0~16KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_RET1N : 1;  /*!< [1] 16~32KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_RET1N : 1;  /*!< [2] 32~48KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_RET1N : 1;  /*!< [3] 48~64KB cpu_ram RET1N */
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_RET2N  : 1;  /*!< [4] 0~16KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_RET2N : 1;  /*!< [5] 16~32KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_RET2N : 1;  /*!< [6] 32~48KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_RET2N : 1;  /*!< [7] 48~64KB cpu_ram RET2N */
    uint32_t PDS_RAM_CFG_0KB_16KB_CPU_RAM_PGEN   : 1;  /*!< [8] 0~16KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_16KB_32KB_CPU_RAM_PGEN  : 1;  /*!< [9] 16~32KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_32KB_48KB_CPU_RAM_PGEN  : 1;  /*!< [10] 32~48KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_48KB_64KB_CPU_RAM_PGEN  : 1;  /*!< [11] 48~64KB cpu_ram PGEN */
    uint32_t PDS_RAM_CFG_RSV                     : 20; /*!< [31:12]reserve */
} PDS_RAM_CFG_Type;

/**
 *  @brief PDS PAD pin configuration type definition
 */
typedef enum {
    PDS_PAD_PIN_GPIO_17, /*!< PAD GPIO 17 */
    PDS_PAD_PIN_GPIO_18, /*!< PAD GPIO 18 */
    PDS_PAD_PIN_GPIO_19, /*!< PAD GPIO 19 */
    PDS_PAD_PIN_GPIO_20, /*!< PAD GPIO 20 */
    PDS_PAD_PIN_GPIO_21, /*!< PAD GPIO 21 */
    PDS_PAD_PIN_GPIO_22, /*!< PAD GPIO 22 */
    PDS_PAD_PIN_GPIO_23, /*!< PAD GPIO 23 */
    PDS_PAD_PIN_GPIO_24, /*!< PAD GPIO 24 */
    PDS_PAD_PIN_GPIO_25, /*!< PAD GPIO 25 */
    PDS_PAD_PIN_GPIO_26, /*!< PAD GPIO 26 */
    PDS_PAD_PIN_GPIO_27, /*!< PAD GPIO 27 */
    PDS_PAD_PIN_GPIO_28, /*!< PAD GPIO 28 */
} PDS_PAD_PIN_Type;

/**
 *  @brief PDS PAD configuration type definition
 */
typedef enum {
    PDS_PAD_CFG_PULL_NONE, /*!< no PD/PU/IE on PAD */
    PDS_PAD_CFG_PULL_DOWN, /*!< Pulldown PAD */
    PDS_PAD_CFG_PULL_UP,   /*!< Pullup PAD */
    PDS_PAD_CFG_ACTIVE_IE, /*!< Active IE */
} PDS_PAD_CFG_Type;

/**
 *  @brief PDS configuration type definition
 */
typedef struct
{
    uint32_t pdsStart                : 1; /*!< [0]PDS Start */
    uint32_t sleepForever            : 1; /*!< [1]PDS sleep forever */
    uint32_t xtalForceOff            : 1; /*!< [2]Power off xtal force */
    uint32_t saveWifiState           : 1; /*!< [3]Save WIFI State Before Enter PDS */
    uint32_t dcdc18Off               : 1; /*!< [4]power down dcdc18 during PDS */
    uint32_t bgSysOff                : 1; /*!< [5]power down bg_sys during PDS */
    uint32_t gpioIePuPd              : 1; /*!< [6]allow PDS Control the GPIO IE/PU/PD at Sleep Mode */
    uint32_t puFlash                 : 1; /*!< [7]turn off Flash Power During PDS */
    uint32_t clkOff                  : 1; /*!< [8]gate clock during PDS (each pwr domain has its own control) */
    uint32_t memStby                 : 1; /*!< [9]mem_stby during PDS (each power domain can has its own control) */
    uint32_t swPuFlash               : 1; /*!< [10]SW Turn on Flash */
    uint32_t isolation               : 1; /*!< [11]Isolation during PDS (each power domain can has its own control) */
    uint32_t waitXtalRdy             : 1; /*!< [12]wait XTAL Ready during before PDS Interrupt */
    uint32_t pdsPwrOff               : 1; /*!< [13]Power off during PDS (each power domain can has its own control) */
    uint32_t xtalOff                 : 1; /*!< [14]xtal power down during PDS */
    uint32_t socEnbForceOn           : 1; /*!< [15]pds_soc_enb always active */
    uint32_t pdsRstSocEn             : 1; /*!< [16]pds_rst controlled by PDS */
    uint32_t pdsRC32mOn              : 1; /*!< [17]RC32M always on or RC32M on/off controlled by PDS state */
    uint32_t pdsLdoVselEn            : 1; /*!< [18]PDS "SLEEP" control LDO voltage enable */
    uint32_t pdsRamLowPowerWithClkEn : 1; /*!< [19]Control SRAM Low Power with CLK (Sync) */
    uint32_t reserved20              : 1; /*!< [20]Reserved */
    uint32_t cpu0WfiMask             : 1; /*!< [21]pds start condition mask np_wfi */
    uint32_t ldo11Off                : 1; /*!< [22]power down ldo11 during PDS */
    uint32_t pdsForceRamClkEn        : 1; /*!< [23]Force SRAM CLK Enable */
    uint32_t pdsLdoVol               : 4; /*!< [27:24]LDO voltage value in PDS mode */
    uint32_t pdsCtlRfSel             : 2; /*!< [29:28]select the way RF controlled by PDS */
    uint32_t pdsCtlPllSel            : 2; /*!< [31:30]select the way PLL controlled by PDS */
} PDS_CFG_Type;

/**
 *  @brief PDS configuration type definition
 */
typedef struct
{
    uint32_t pdsStart                : 1; /*!< [0]PDS Start */
    uint32_t sleepForever            : 1; /*!< [1]PDS sleep forever */
    uint32_t xtalForceOff            : 1; /*!< [2]Power off xtal force */
    uint32_t saveWifiState           : 1; /*!< [3]Save WIFI State Before Enter PDS */
    uint32_t dcdc18Off               : 1; /*!< [4]power down dcdc18 during PDS */
    uint32_t bgSysOff                : 1; /*!< [5]power down bg_sys during PDS */
    uint32_t gpioIePuPd              : 1; /*!< [6]allow PDS Control the GPIO IE/PU/PD at Sleep Mode */
    uint32_t puFlash                 : 1; /*!< [7]turn off Flash Power During PDS */
    uint32_t clkOff                  : 1; /*!< [8]gate clock during PDS (each pwr domain has its own control) */
    uint32_t memStby                 : 1; /*!< [9]mem_stby during PDS (each power domain can has its own control) */
    uint32_t swPuFlash               : 1; /*!< [10]SW Turn on Flash */
    uint32_t isolation               : 1; /*!< [11]Isolation during PDS (each power domain can has its own control) */
    uint32_t waitXtalRdy             : 1; /*!< [12]wait XTAL Ready during before PDS Interrupt */
    uint32_t pdsPwrOff               : 1; /*!< [13]Power off during PDS (each power domain can has its own control) */
    uint32_t xtalOff                 : 1; /*!< [14]xtal power down during PDS */
    uint32_t socEnbForceOn           : 1; /*!< [15]pds_soc_enb always active */
    uint32_t pdsRstSocEn             : 1; /*!< [16]pds_rst controlled by PDS */
    uint32_t pdsRC32mOn              : 1; /*!< [17]RC32M always on or RC32M on/off controlled by PDS state */
    uint32_t pdsLdoVselEn            : 1; /*!< [18]PDS "SLEEP" control LDO voltage enable */
    uint32_t pdsRamLowPowerWithClkEn : 1; /*!< [19]Control SRAM Low Power with CLK (Sync) */
    uint32_t reserved20              : 1; /*!< [20]Reserved */
    uint32_t cpu0WfiMask             : 1; /*!< [21]pds start condition mask np_wfi */
    uint32_t ldo11Off                : 1; /*!< [22]power down ldo11 during PDS */
    uint32_t pdsForceRamClkEn        : 1; /*!< [23]Force SRAM CLK Enable */
    uint32_t pdsLdoVol               : 4; /*!< [27:24]LDO voltage value in PDS mode */
    uint32_t pdsCtlRfSel             : 2; /*!< [29:28]select the way RF controlled by PDS */
    uint32_t pdsCtlPllSel            : 2; /*!< [31:30]select the way PLL controlled by PDS */
} PDS_CTL_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t forceCpuPwrOff  : 1;  /*!< [0]manual force NP power off */
    uint32_t rsv1            : 1;  /*!< [1]reserve */
    uint32_t forceBzPwrOff   : 1;  /*!< [2]manual force BZ power off */
    uint32_t forceUsbPwrOff  : 1;  /*!< [3]manual force USB power off */
    uint32_t forceCpuIsoEn   : 1;  /*!< [4]manual force NP isolation */
    uint32_t rsv5            : 1;  /*!< [5]reserve */
    uint32_t forceBzIsoEn    : 1;  /*!< [6]manual force BZ isolation */
    uint32_t forceUsbIsoEn   : 1;  /*!< [7]manual force USB isolation */
    uint32_t forceCpuPdsRst  : 1;  /*!< [8]manual force NP pds reset */
    uint32_t rsv9            : 1;  /*!< [9]reserve */
    uint32_t forceBzPdsRst   : 1;  /*!< [10]manual force BZ pds reset */
    uint32_t forceUsbPdsRst  : 1;  /*!< [11]manual force USB pds reset */
    uint32_t forceCpuMemStby : 1;  /*!< [12]manual force NP memory sleep */
    uint32_t rsv13           : 1;  /*!< [13]reserve */
    uint32_t forceBzMemStby  : 1;  /*!< [14]manual force BZ memory sleep */
    uint32_t forceUsbMemStby : 1;  /*!< [15]manual force USB memory sleep */
    uint32_t forceCpuGateClk : 1;  /*!< [16]manual force NP clock gated */
    uint32_t rsv17           : 1;  /*!< [17]reserve */
    uint32_t forceBzGateClk  : 1;  /*!< [18]manual force BZ clock gated */
    uint32_t forceUsbGateClk : 1;  /*!< [19]manual force USB clock gated */
    uint32_t rsv20_31        : 12; /*!< [31:20]reserve */
} PDS_CTL2_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t rsv0             : 1; /*!< [0]reserve */
    uint32_t forceMiscPwrOff  : 1; /*!< [1]manual force MISC pwr_off */
    uint32_t forceBlePwrOff   : 1; /*!< [2]manual force BZ_BLE pwr_off */
    uint32_t rsv3_4           : 2; /*!< [4:3]reserve */
    uint32_t forceBleIsoEn    : 1; /*!< [5]manual force BZ_BLE iso_en */
    uint32_t rsv6             : 1; /*!< [6]reserve */
    uint32_t forceMiscPdsRst  : 1; /*!< [7]manual force MISC pds_rst */
    uint32_t forceBlePdsRst   : 1; /*!< [8]manual force BZ_BLE pds_rst */
    uint32_t rsv9             : 1; /*!< [9]reserve */
    uint32_t forceMiscMemStby : 1; /*!< [10]manual force MISC mem_stby */
    uint32_t forceBleMemStby  : 1; /*!< [11]manual force BZ_BLE mem_stby */
    uint32_t rsv12            : 1; /*!< [12]reserve */
    uint32_t forceMiscGateClk : 1; /*!< [13]manual force MISC gate_clk */
    uint32_t forceBleGateClk  : 1; /*!< [14]manual force BZ_BLE gate_clk */
    uint32_t rsv15_23         : 9; /*!< [23:15]reserve */
    uint32_t CpuIsoEn         : 1; /*!< [24]make NP isolated at PDS Sleep state */
    uint32_t rsv25_26         : 2; /*!< [26:25]reserve */
    uint32_t BzIsoEn          : 1; /*!< [27]make BZ isolated at PDS Sleep state */
    uint32_t BleIsoEn         : 1; /*!< [28]make Ble isolated at PDS Sleep state */
    uint32_t UsbIsoEn         : 1; /*!< [29]make USB isolated at PDS Sleep state */
    uint32_t MiscIsoEn        : 1; /*!< [30]make misc isolated at PDS Sleep state */
    uint32_t rsv31            : 1; /*!< [31]reserve */
} PDS_CTL3_Type;

/**
 *  @brief PDS force configuration type definition
 */
typedef struct
{
    uint32_t cpuPwrOff     : 1; /*!< [0] */
    uint32_t cpuRst        : 1; /*!< [1] */
    uint32_t cpuMemStby    : 1; /*!< [2] */
    uint32_t cpuGateClk    : 1; /*!< [3] */
    uint32_t rsv4_11       : 8; /*!< [11:4]reserve */
    uint32_t BzPwrOff      : 1; /*!< [12] */
    uint32_t BzRst         : 1; /*!< [13] */
    uint32_t BzMemStby     : 1; /*!< [14] */
    uint32_t BzGateClk     : 1; /*!< [15] */
    uint32_t BlePwrOff     : 1; /*!< [16] */
    uint32_t BleRst        : 1; /*!< [17] */
    uint32_t BleMemStby    : 1; /*!< [18] */
    uint32_t BleGateClk    : 1; /*!< [19] */
    uint32_t UsbPwrOff     : 1; /*!< [20] */
    uint32_t UsbRst        : 1; /*!< [21] */
    uint32_t UsbMemStby    : 1; /*!< [22] */
    uint32_t UsbGateClk    : 1; /*!< [23] */
    uint32_t MiscPwrOff    : 1; /*!< [24] */
    uint32_t MiscRst       : 1; /*!< [25] */
    uint32_t MiscMemStby   : 1; /*!< [26] */
    uint32_t MiscGateClk   : 1; /*!< [27] */
    uint32_t rsv28_29      : 2; /*!< [29:28]reserve */
    uint32_t MiscAnaPwrOff : 1; /*!< [30] */
    uint32_t MiscDigPwrOff : 1; /*!< [31] */
} PDS_CTL4_Type;

/**
 *  @brief PDS default level configuration type definition
 */
typedef struct
{
    PDS_CTL_Type pdsCtl;   /*!< PDS_CTL configuration */
    PDS_CTL2_Type pdsCtl2; /*!< PDS_CTL2 configuration */
    PDS_CTL3_Type pdsCtl3; /*!< PDS_CTL3 configuration */
    PDS_CTL4_Type pdsCtl4; /*!< PDS_CTL4 configuration */
} PDS_DEFAULT_LV_CFG_Type;

/**
 *  @brief PDS interrupt type definition
 */
typedef enum {
    PDS_INT_WAKEUP = 0,    /*!< PDS wakeup interrupt(assert bit while wakeup, include PDS_Timer/...) */
    PDS_INT_RF_DONE,       /*!< PDS RF done interrupt */
    PDS_INT_PLL_DONE,      /*!< PDS PLL done interrupt */
    PDS_INT_PDS_SLEEP_CNT, /*!< wakeup trigger by pds_sleep_cnt=0 */
    PDS_INT_HBN_IRQ_OUT0,  /*!< wakeup trigger by hbn_irq_out[0] */
    PDS_INT_HBN_IRQ_OUT1,  /*!< wakeup trigger by hbn_irq_out[1] */
    PDS_INT_GPIO_IRQ,      /*!< wakeup trigger by gpio_irq */
    PDS_INT_IRRX,          /*!< wakeup trigger by irrx_int */
    PDS_INT_BLE_SLP_IRQ,   /*!< wakeup trigger by ble_slp_irq */
    PDS_INT_USB_WKUP,      /*!< wakeup trigger by usb_wkup */
    PDS_INT_KYS_QDEC,      /*!< wakeup trigger by kys_int or qdec */
    PDS_INT_MAX,           /*!< PDS int max number */
} PDS_INT_Type;

/**
 *  @brief PDS vddcore GPIO interrupt type definition
 */
typedef enum {
    PDS_VDDCORE_GPIO_SRC_GPIO_0, /*!< PDS VDDCORE GPIO0 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_1, /*!< PDS VDDCORE GPIO1 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_2, /*!< PDS VDDCORE GPIO2 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_3, /*!< PDS VDDCORE GPIO3 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_4, /*!< PDS VDDCORE GPIO4 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_5, /*!< PDS VDDCORE GPIO5 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_6, /*!< PDS VDDCORE GPIO6 as PDS interrupt source */
    PDS_VDDCORE_GPIO_SRC_GPIO_7, /*!< PDS VDDCORE GPIO7 as PDS interrupt source */
} PDS_VDDCORE_GPIO_SRC_Type;

/**
 *  @brief PDS reset event type definition
 */
typedef enum {
    PDS_RST_EVENT_BUS_RST,        /*!< hreset_n (Bus Reset) */
    PDS_RST_EVENT_HBN_PWR_ON_RST, /*!< pwr_rst_n (hbn power on reset) */
    PDS_RST_EVENT_PDS_RST,        /*!< pds_rst_n (pds reset) */
    PDS_RST_EVENT_MAX,            /*!< PDS rst event max number */
} PDS_RST_EVENT_Type;

/**
 *  @brief PDS PLL status type definition
 */
typedef enum {
    PDS_PLL_STS_OFF = 0,   /*!< 2'b00 */
    PDS_PLL_STS_SFREG = 1, /*!< 2'b01 */
    PDS_PLL_STS_PU = 2,    /*!< 2'b10 */
    PDS_PLL_STS_RDY = 3,   /*!< 2'b11 */
} PDS_PLL_STS_Type;

/**
 *  @brief PDS RF status type definition
 */
typedef enum {
    PDS_RF_STS_OFF = 0,        /*!< 4'b0000 */
    PDS_RF_STS_PU_MBG = 1,     /*!< 4'b0001 */
    PDS_RF_STS_PU_LDO15RF = 3, /*!< 4'b0011 */
    PDS_RF_STS_PU_SFREG = 7,   /*!< 4'b0111 */
    PDS_RF_STS_BZ_EN_AON = 15, /*!< 4'b1111 */
} PDS_RF_STS_Type;

/**
 *  @brief PDS status type definition
 */
typedef enum {
    PDS_STS_IDLE = 0,            /*!< 4'b0000 */
    PDS_STS_ECG = 8,             /*!< 4'b1000 */
    PDS_STS_ERST = 12,           /*!< 4'b1100 */
    PDS_STS_EISO = 15,           /*!< 4'b1111 */
    PDS_STS_POFF = 7,            /*!< 4'b0111 */
    PDS_STS_PRE_BGON = 3,        /*!< 4'b0011 */
    PDS_STS_PRE_BGON1 = 1,       /*!< 4'b0001 */
    PDS_STS_BGON = 5,            /*!< 4'b0101 */
    PDS_STS_CLK_SW_32M = 4,      /*!< 4'b0100 */
    PDS_STS_PON_DCDC = 6,        /*!< 4'b0110 */
    PDS_STS_PON_LDO11_MISC = 14, /*!< 4'b1110 */
    PDS_STS_PON = 10,            /*!< 4'b1010 */
    PDS_STS_DISO = 2,            /*!< 4'b0010 */
    PDS_STS_DCG = 13,            /*!< 4'b1101 */
    PDS_STS_DRST = 11,           /*!< 4'b1011 */
    PDS_STS_WAIT_EFUSE = 9,      /*!< 4'b1001 */
} PDS_STS_Type;

/**
 *  @brief PLL XTAL type definition
 */
typedef enum {
    PDS_PLL_XTAL_NONE,  /*!< XTAL is none */
    PDS_PLL_XTAL_32M,   /*!< XTAL is 32M */
    PDS_PLL_XTAL_RC32M, /*!< XTAL is RC32M */
} PDS_PLL_XTAL_Type;

/**
 *  @brief PLL output clock type definition
 */
typedef enum {
    PDS_PLL_CLK_480M, /*!< PLL output clock:480M */
    PDS_PLL_CLK_240M, /*!< PLL output clock:240M */
    PDS_PLL_CLK_192M, /*!< PLL output clock:192M */
    PDS_PLL_CLK_160M, /*!< PLL output clock:160M */
    PDS_PLL_CLK_120M, /*!< PLL output clock:120M */
    PDS_PLL_CLK_96M,  /*!< PLL output clock:96M */
    PDS_PLL_CLK_80M,  /*!< PLL output clock:80M */
    PDS_PLL_CLK_48M,  /*!< PLL output clock:48M */
    PDS_PLL_CLK_32M,  /*!< PLL output clock:32M */
} PDS_PLL_CLK_Type;

/**
 *  @brief PDS level 0-7 mode HBN GPIO interrupt trigger type definition
 */
typedef enum {
    PDS_AON_GPIO_INT_TRIGGER_SYNC_FALLING_EDGE,  /*!< PDS level 0-7 mode HBN GPIO INT trigger type: sync falling edge trigger */
    PDS_AON_GPIO_INT_TRIGGER_SYNC_RISING_EDGE,   /*!< PDS level 0-7 mode HBN GPIO INT trigger type: sync rising edge trigger */
    PDS_AON_GPIO_INT_TRIGGER_SYNC_LOW_LEVEL,     /*!< PDS level 0-7 mode HBN GPIO INT trigger type: sync low level trigger */
    PDS_AON_GPIO_INT_TRIGGER_SYNC_HIGH_LEVEL,    /*!< PDS level 0-7 mode HBN GPIO INT trigger type: sync high level trigger */
    PDS_AON_GPIO_INT_TRIGGER_ASYNC_FALLING_EDGE, /*!< PDS level 0-7 mode HBN GPIO INT trigger type: async falling edge trigger */
    PDS_AON_GPIO_INT_TRIGGER_ASYNC_RISING_EDGE,  /*!< PDS level 0-7 mode HBN GPIO INT trigger type: async rising edge trigger */
    PDS_AON_GPIO_INT_TRIGGER_ASYNC_LOW_LEVEL,    /*!< PDS level 0-7 mode HBN GPIO INT trigger type: async low level trigger */
    PDS_AON_GPIO_INT_TRIGGER_ASYNC_HIGH_LEVEL,   /*!< PDS level 0-7 mode HBN GPIO INT trigger type: async high level trigger */
} PDS_AON_GPIO_INT_Trigger_Type;

/**
 *  @brief PDS APP configuration type definition
 */
typedef struct
{
    uint8_t pdsLevel;                                 /*!< PDS level */
    uint8_t turnOffXtal32m;                           /*!< Wheather turn off XTAL32M */
    uint8_t turnOffDll;                               /*!< Wheather turn off DLL */
    uint8_t turnOffRF;                                /*!< Wheather turn off RF */
    uint8_t useXtal32k;                               /*!< Wheather use xtal 32K as 32K clock source,otherwise use rc32k */
    uint8_t pdsAonGpioWakeupSrc;                      /*!< PDS level 0-7,31 mode aon GPIO Wakeup source(HBN wakeup pin) */
    PDS_AON_GPIO_INT_Trigger_Type pdsAonGpioTrigType; /*!< PDS level 0-7,31 mode aon GPIO Triger type(HBN wakeup pin) */
    uint8_t powerDownFlash;                           /*!< Whether power down flash */
    uint8_t pdsHoldGpio;                              /*!< Whether pds hold gpio level */
    uint8_t turnOffFlashPad;                          /*!< Whether turn off flash pad(GPIO17-GPIO22, GPIO23-GPIO28) */
    uint8_t flashPinCfg;                              /*!< 0 ext flash 23-28, 1 internal flash 23-28, 2 internal flash 23-28, 3 ext flash 17-22 */
    uint8_t turnoffPLL;                               /*!< Whether trun off PLL */
    uint8_t xtalType;                                 /*!< XTal type, used when user choose turn off PLL, PDS will turn on when exit PDS mode */
    uint8_t flashContRead;                            /*!< Whether enable flash continue read */
    uint32_t sleepTime;                               /*!< PDS sleep time */
    spi_flash_cfg_type *flashCfg;                     /*!< Flash config pointer, used when power down flash */
    HBN_LDO_LEVEL_Type ldoLevel;                      /*!< LDO level */
    void (*preCbFun)(void);                           /*!< Pre callback function */
    void (*postCbFun)(void);                          /*!< Post callback function */
} PDS_APP_CFG_Type;

/**
 *  @brief PDS LDO voltage type definition
 */
typedef enum {
    PDS_LDO_VOLTAGE_0P60V, /*!< PDS LDO voltage 0.60V */
    PDS_LDO_VOLTAGE_0P65V, /*!< PDS LDO voltage 0.65V */
    PDS_LDO_VOLTAGE_0P70V, /*!< PDS LDO voltage 0.70V */
    PDS_LDO_VOLTAGE_0P75V, /*!< PDS LDO voltage 0.75V */
    PDS_LDO_VOLTAGE_0P80V, /*!< PDS LDO voltage 0.80V */
    PDS_LDO_VOLTAGE_0P85V, /*!< PDS LDO voltage 0.85V */
    PDS_LDO_VOLTAGE_0P90V, /*!< PDS LDO voltage 0.9V */
    PDS_LDO_VOLTAGE_0P95V, /*!< PDS LDO voltage 0.95V */
    PDS_LDO_VOLTAGE_1P00V, /*!< PDS LDO voltage 1.0V */
    PDS_LDO_VOLTAGE_1P05V, /*!< PDS LDO voltage 1.05V */
    PDS_LDO_VOLTAGE_1P10V, /*!< PDS LDO voltage 1.1V */
    PDS_LDO_VOLTAGE_1P15V, /*!< PDS LDO voltage 1.15V */
    PDS_LDO_VOLTAGE_1P20V, /*!< PDS LDO voltage 1.2V */
    PDS_LDO_VOLTAGE_1P25V, /*!< PDS LDO voltage 1.25V */
    PDS_LDO_VOLTAGE_1P30V, /*!< PDS LDO voltage 1.3V */
    PDS_LDO_VOLTAGE_1P35V, /*!< PDS LDO voltage 1.35V */
} PDS_LDO_VOLTAGE_Type;

